; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-4-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	p0-2 - location
	p0-5 - location
	p0-6 - location
	p0-11 - location
	p1-5 - location
	p2-1 - location
	p2-4 - location
	p2-8 - location
	p4-7 - location
	p5-9 - location
	p6-0 - location
	p6-9 - location
	p6-11 - location
	p7-2 - location
	p8-1 - location
	p8-3 - location
	p8-4 - location
	p8-7 - location
	p9-4 - location
	p9-11 - location
	p10-0 - location
	p10-1 - location
	p11-2 - location
	)
	(:init
	(at driver1 s8)
	(at driver2 s5)
	(at driver3 s5)
	(at driver4 s10)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s9)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s6)
	(empty truck4)
	(at package1 s3)
	(at package2 s2)
	(at package3 s8)
	(at package4 s11)
	(at package5 s1)
	(at package6 s8)
	(at package7 s9)
	(at package8 s10)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s0 p0-11)
	(path p0-11 s0)
	(path s11 p0-11)
	(path p0-11 s11)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s5 p5-9)
	(path p5-9 s5)
	(path s9 p5-9)
	(path p5-9 s9)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(path s6 p6-11)
	(path p6-11 s6)
	(path s11 p6-11)
	(path p6-11 s11)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(path s9 p9-11)
	(path p9-11 s9)
	(path s11 p9-11)
	(path p9-11 s11)
	(path s10 p10-0)
	(path p10-0 s10)
	(path s0 p10-0)
	(path p10-0 s0)
	(path s10 p10-1)
	(path p10-1 s10)
	(path s1 p10-1)
	(path p10-1 s1)
	(path s11 p11-2)
	(path p11-2 s11)
	(path s2 p11-2)
	(path p11-2 s2)
	(link s0 s5)
	(link s5 s0)
	(link s0 s8)
	(link s8 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s9)
	(link s9 s1)
	(link s1 s10)
	(link s10 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s5)
	(link s5 s2)
	(link s2 s8)
	(link s8 s2)
	(link s2 s9)
	(link s9 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s8)
	(link s8 s3)
	(link s3 s10)
	(link s10 s3)
	(link s5 s3)
	(link s3 s5)
	(link s5 s4)
	(link s4 s5)
	(link s5 s8)
	(link s8 s5)
	(link s5 s9)
	(link s9 s5)
	(link s6 s1)
	(link s1 s6)
	(link s6 s3)
	(link s3 s6)
	(link s6 s4)
	(link s4 s6)
	(link s6 s7)
	(link s7 s6)
	(link s6 s9)
	(link s9 s6)
	(link s7 s5)
	(link s5 s7)
	(link s7 s11)
	(link s11 s7)
	(link s8 s6)
	(link s6 s8)
	(link s9 s0)
	(link s0 s9)
	(link s9 s3)
	(link s3 s9)
	(link s9 s4)
	(link s4 s9)
	(link s9 s7)
	(link s7 s9)
	(link s9 s8)
	(link s8 s9)
	(link s10 s2)
	(link s2 s10)
	(link s10 s6)
	(link s6 s10)
	(link s11 s0)
	(link s0 s11)
	(link s11 s3)
	(link s3 s11)
)
	(:goal (and
	(at driver3 s8)
	(at truck3 s8)
	(at package1 s2)
	(at package2 s5)
	(at package3 s1)
	(at package4 s7)
	(at package5 s0)
	(at package6 s11)
	(at package7 s2)
	(at package8 s0)
	))
(:metric minimize (total-time))
)

; plan
1. (load-truck package1 truck3 s3)
   deleted: (at package1 s3)
   added: (in package1 truck3)
   goals met: 0 of 10
2. (walk driver3 s5 p1-5)
   deleted: (at driver3 s5)
   added: (at driver3 p1-5)
   goals met: 0 of 10
3. (walk driver3 p1-5 s1)
   deleted: (at driver3 p1-5)
   added: (at driver3 s1)
   goals met: 0 of 10
4. (walk driver3 s1 p8-1)
   deleted: (at driver3 s1)
   added: (at driver3 p8-1)
   goals met: 0 of 10
5. (walk driver3 p8-1 s8)
   deleted: (at driver3 p8-1)
   added: (at driver3 s8)
   goals met: 1 of 10
6. (walk driver1 s8 p8-3)
   deleted: (at driver1 s8)
   added: (at driver1 p8-3)
   goals met: 1 of 10
7. (walk driver1 p8-3 s3)
   deleted: (at driver1 p8-3)
   added: (at driver1 s3)
   goals met: 1 of 10
8. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 1 of 10
9. (drive-truck truck3 s3 s2 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   goals met: 1 of 10
10. (unload-truck package1 truck3 s2)
   deleted: (in package1 truck3)
   added: (at package1 s2)
   goals met: 2 of 10
11. (drive-truck truck3 s2 s9 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s9)
   goals met: 2 of 10
12. (load-truck package7 truck3 s9)
   deleted: (at package7 s9)
   added: (in package7 truck3)
   goals met: 2 of 10
13. (drive-truck truck3 s9 s2 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s2)
   goals met: 2 of 10
14. (unload-truck package7 truck3 s2)
   deleted: (in package7 truck3)
   added: (at package7 s2)
   goals met: 3 of 10
15. (load-truck package2 truck3 s2)
   deleted: (at package2 s2)
   added: (in package2 truck3)
   goals met: 3 of 10
16. (drive-truck truck3 s2 s5 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   goals met: 3 of 10
17. (unload-truck package2 truck3 s5)
   deleted: (in package2 truck3)
   added: (at package2 s5)
   goals met: 4 of 10
18. (drive-truck truck3 s5 s2 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 4 of 10
19. (drive-truck truck3 s2 s8 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s8)
   goals met: 5 of 10
20. (load-truck package6 truck3 s8)
   deleted: (at package6 s8)
   added: (in package6 truck3)
   goals met: 5 of 10
21. (load-truck package3 truck3 s8)
   deleted: (at package3 s8)
   added: (in package3 truck3)
   goals met: 5 of 10
22. (drive-truck truck3 s8 s0 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s0)
   goals met: 4 of 10
23. (drive-truck truck3 s0 s11 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s11)
   goals met: 4 of 10
24. (unload-truck package6 truck3 s11)
   deleted: (in package6 truck3)
   added: (at package6 s11)
   goals met: 5 of 10
25. (load-truck package4 truck3 s11)
   deleted: (at package4 s11)
   added: (in package4 truck3)
   goals met: 5 of 10
26. (drive-truck truck3 s11 s7 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s7)
   goals met: 5 of 10
27. (unload-truck package4 truck3 s7)
   deleted: (in package4 truck3)
   added: (at package4 s7)
   goals met: 6 of 10
28. (drive-truck truck3 s7 s9 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s9)
   goals met: 6 of 10
29. (drive-truck truck3 s9 s1 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s1)
   goals met: 6 of 10
30. (unload-truck package3 truck3 s1)
   deleted: (in package3 truck3)
   added: (at package3 s1)
   goals met: 7 of 10
31. (load-truck package5 truck3 s1)
   deleted: (at package5 s1)
   added: (in package5 truck3)
   goals met: 7 of 10
32. (drive-truck truck3 s1 s10 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s10)
   goals met: 7 of 10
33. (load-truck package8 truck3 s10)
   deleted: (at package8 s10)
   added: (in package8 truck3)
   goals met: 7 of 10
34. (drive-truck truck3 s10 s1 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s1)
   goals met: 7 of 10
35. (drive-truck truck3 s1 s0 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 7 of 10
36. (unload-truck package8 truck3 s0)
   deleted: (in package8 truck3)
   added: (at package8 s0)
   goals met: 8 of 10
37. (unload-truck package5 truck3 s0)
   deleted: (in package5 truck3)
   added: (at package5 s0)
   goals met: 9 of 10
38. (drive-truck truck3 s0 s8 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s8)
   goals met: 10 of 10
